gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lock/User/platform_map.c
	/* NBIot 接收数据包数 */
	TCFG_SystemData.NBIotRecvCount = 0;
	TCFG_EEPROM_SetNBIotRecvCount(TCFG_SystemData.NBIotRecvCount);
	
	/* NBIot 一天发送数据包数 */
	TCFG_SystemData.NBIotSentCountDay = 0;
	TCFG_EEPROM_SetNBIotSentCountDay(TCFG_SystemData.NBIotSentCountDay);
	
	/* NBIot 一天限定数据包数 */
	TCFG_EEPROM_SetNBIotSentCountLimit(NBIOT_SNEDCOUNTDAY_LIMIT_NUM);
	
	/* RF命令接收条数 */
	TCFG_SystemData.RFCommandCount = 0;
	TCFG_EEPROM_SetRFCmdCnt(TCFG_SystemData.RFCommandCount);
	
	/* NB命令接收条数 */
	TCFG_SystemData.NBCommandCount = 0;
	TCFG_EEPROM_SetNBCmdCnt(TCFG_SystemData.NBCommandCount);
	
	/* Coap间隔时间发送普通数据包用于接收下行数据 */
	TCFG_SystemData.CoapRATimeHour = NBCOAP_RATIME_NORMAL_TYPE;
	TCFG_EEPROM_SetCoapRATimeHour(TCFG_SystemData.CoapRATimeHour);
	
	/* Coap保持连接时间 */
	TCFG_SystemData.CoapConnectTime = 0;
	TCFG_EEPROM_SetCoapConnectTime(TCFG_SystemData.CoapConnectTime);
	
	/* Coap休眠时间 */
	TCFG_SystemData.CoapIdleTime = 0;
	TCFG_EEPROM_SetCoapIdleTime(TCFG_SystemData.CoapIdleTime);
	
	/* 升级信号值限制下限 */
	TCFG_SystemData.UpgradeLimitRssi = NBCOAP_PCP_UPGRADE_LIMIT_RSSI;
	TCFG_EEPROM_SetUpgradeLimitRssi(TCFG_SystemData.UpgradeLimitRssi);
	
	/* 升级信号质量限制下限 */
	TCFG_SystemData.UpgradeLimitSnr = NBCOAP_PCP_UPGRADE_LIMIT_SNR;
	TCFG_EEPROM_SetUpgradeLimitSnr(TCFG_SystemData.UpgradeLimitSnr);
	
	/* 蜂鸣器控制 */
	TCFG_SystemData.BeepCtrlOff = 0;
	TCFG_EEPROM_SetBeepOff(TCFG_SystemData.BeepCtrlOff);
	
	/* 翻转初始化控制 */
	TCFG_SystemData.RollingOverInitSensor = ROLLINGOVER_INITSENSOR_DEFAULT;
	TCFG_EEPROM_SetRollingOverInitSensor(TCFG_SystemData.RollingOverInitSensor);
	
	/* 设备重启方式 */
	TCFG_SystemData.DeviceRbtMode = RBTMODE_MODE_NONE;
	TCFG_EEPROM_SetDeviceRbtMode(TCFG_SystemData.DeviceRbtMode);
	
	/* NB核心网地址 */
#if NETPROTOCAL == NETCOAP
	TCFG_EEPROM_Write_CoAPCDPAddr();
#endif
	
	/* MqttSN服务器地址 */
#if NETPROTOCAL == NETMQTTSN
	TCFG_EEPROM_Write_MqttSNServerAddr();
#endif
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_ReadConfigData(void)
 @Description			TCFG_EEPROM_ReadConfigData					: 读取系统配置信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_ReadConfigData(void)
{
	/* 获取SubSN */
	TCFG_SystemData.SubSn = TCFG_EEPROM_Get_MAC_SN();
	TCFG_EEPROM_Get_MAC_SN_String();
	
	/* 获取传感器灵敏度值 */
	TCFG_SystemData.Sensitivity = TCFG_EEPROM_GetSavedSensitivity();
	if ((TCFG_SystemData.Sensitivity > SENSE_LOWEST) || (TCFG_SystemData.Sensitivity < SENSE_HIGHEST)) {
		TCFG_SystemData.Sensitivity = SENSE_MIDDLE;
		TCFG_EEPROM_SetSavedSensitivity(TCFG_SystemData.Sensitivity);
	}
	
	/* 获取雷达覆盖时的增益值 */
	TCFG_SystemData.CoverGain = TCFG_EEPROM_GetCoverGain();
	if ((TCFG_SystemData.CoverGain < RADAR_COVERGAIN_LOW) || (TCFG_SystemData.CoverGain > RADAR_COVERGAIN_HIGH)) {
		TCFG_SystemData.CoverGain = RADAR_COVERGAIN_DEFAULT;
		TCFG_EEPROM_SetCoverGain(TCFG_SystemData.CoverGain);
	}
	
	/* 获取雷达增益值 */
	TCFG_SystemData.RadarGain = TCFG_EEPROM_GetRadarGain();
	if ((TCFG_SystemData.RadarGain > TRADAR_GAIN_HIGHEST) || (TCFG_SystemData.RadarGain < TRADAR_GAIN_LOWEST)) {
		TCFG_SystemData.RadarGain = TRADAR_GAIN_DEFAULT;
		TCFG_EEPROM_SetRadarGain(TCFG_SystemData.RadarGain);
	}
	
	/* 获取高通滤波器截止频率 */
	TCFG_SystemData.RadarHighPass = TCFG_EEPROM_GetHighPass();
	if ((TCFG_SystemData.RadarHighPass < RADAR_HIGHPASS_800) || (TCFG_SystemData.RadarHighPass > RADAR_HIGHPASS_1200)) {
		TCFG_SystemData.RadarHighPass = TRADAR_HIGHPASS_DEFAULT;
		TCFG_EEPROM_SetHighPass(TCFG_SystemData.RadarHighPass);
	}
	
	/* 获取采样间隔,间隔越小越省电,但对实时性要求越高 */
	TCFG_SystemData.RadarSampleInterval = TCFG_EEPROM_GetSampleInterval();
	Radar_Set_SampleInterval(TCFG_SystemData.RadarSampleInterval);
	
	/* 获取BOOT版本号 */
	TCFG_SystemData.BootVersion = TCFG_EEPROM_GetBootVersion();
	
	/* 地磁背景值 */
	TCFG_SystemData.MagBackgroundX = TCFG_EEPROM_GetMagBackgroud(TCFG_X_AXIS);
	TCFG_SystemData.MagBackgroundY = TCFG_EEPROM_GetMagBackgroud(TCFG_Y_AXIS);
	TCFG_SystemData.MagBackgroundZ = TCFG_EEPROM_GetMagBackgroud(TCFG_Z_AXIS);
	
	/* 写入背景值 */
	memset((void*)&Qmc5883lData, 1, sizeof(Qmc5883lData));
	Qmc5883lData.X_Back = TCFG_SystemData.MagBackgroundX;
	Qmc5883lData.Y_Back = TCFG_SystemData.MagBackgroundY;
	Qmc5883lData.Z_Back = TCFG_SystemData.MagBackgroundZ;
	
	/* 手动地磁背景值 */
	for (unsigned char i = 0; i < 5; i++) {
		TCFG_SystemData.MagBackManualX[i] = TCFG_EEPROM_GetMagManualBack(i, TCFG_X_AXIS);
		TCFG_SystemData.MagBackManualY[i] = TCFG_EEPROM_GetMagManualBack(i, TCFG_Y_AXIS);
		TCFG_SystemData.MagBackManualZ[i] = TCFG_EEPROM_GetMagManualBack(i, TCFG_Z_AXIS);
		if (TCFG_SystemData.MagBackManualX[i] == 0) break;
		talgo_set_manual_back(i, TCFG_SystemData.MagBackManualX[i], TCFG_SystemData.MagBackManualY[i], TCFG_SystemData.MagBackManualZ[i]);
	}
	
	/* 地磁背景温度补偿值 */
	TCFG_SystemData.MagBackgroudTemp = TCFG_EEPROM_GetMagBackgroudTemp();
	Qmc5883lData.temp_back = TCFG_SystemData.MagBackgroudTemp;
	
	/* 地磁温飘计算值 */
	TCFG_EEPROM_GetMagTempCoef(&TCFG_SystemData.MagCoefX, &TCFG_SystemData.MagCoefY, &TCFG_SystemData.MagCoefZ);
	Qmc5883lData.X_Coef = TCFG_SystemData.MagCoefX;
	Qmc5883lData.Y_Coef = TCFG_SystemData.MagCoefY;
	Qmc5883lData.Z_Coef = TCFG_SystemData.MagCoefZ;
	
	/* 获取设备工作模式 */
	TCFG_SystemData.WorkMode = TCFG_EEPROM_GetWorkMode();
	if ((TCFG_SystemData.WorkMode != DEBUG_WORK) && (TCFG_SystemData.WorkMode != NORMAL_WORK)) {
		TCFG_SystemData.WorkMode = NORMAL_WORK;
		TCFG_EEPROM_SetWorkMode(TCFG_SystemData.WorkMode);
	}
	
	/* 无线通道选择 */
	TCFG_SystemData.RFChannel = TCFG_EEPROM_GetRfChannel();
	RF_CHANNEL1 = TCFG_SystemData.RFChannel;
	
	/* 无线心跳间隔 */
	TCFG_SystemData.Heartinterval = TCFG_EEPROM_GetHeartinterval();
	if ((TCFG_SystemData.Heartinterval > 120) || (TCFG_SystemData.Heartinterval < 1)) {
		TCFG_SystemData.Heartinterval = HEART_INTERVAL;
		TCFG_EEPROM_SetHeartinterval(TCFG_SystemData.Heartinterval);
	}
	
	/* 无线调试输出等级 */
	TCFG_SystemData.RFDprintLv = TCFG_EEPROM_GetRFDprintLv();
	if (TCFG_SystemData.RFDprintLv == 0) {
		TCFG_SystemData.RFDprintLv = RF_DPRINT_LV_TYPE;
		TCFG_EEPROM_SetRFDprintLv(TCFG_SystemData.RFDprintLv);
	}
	
