gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lock/User/platform_map.c
/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioRXtime(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioRXtime				: 读取Nbiot RadioRXtime值
 @Input				void
 @Return				RadioRXtime
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioRXtime(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.RXtime;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.RXtime;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.RXtime;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioCellID				: 读取Nbiot RadioCellID值
 @Input				void
 @Return				RadioCellID
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.CellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.CellID;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.CellID;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioECL(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioECL				: 读取Nbiot RadioECL值
 @Input				void
 @Return				RadioECL
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioECL(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.ECL;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.ECL;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.ECL;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioSNR(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioSNR				: 读取Nbiot RadioSNR值
 @Input				void
 @Return				RadioSNR
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioSNR(void)
{
	int nbRadioSnr = 0;
	
#if NETPROTOCAL == NETCOAP
	nbRadioSnr = NbiotClientHandler.Parameter.statisticsRADIO.SNR >  127 ?  127 : NbiotClientHandler.Parameter.statisticsRADIO.SNR;
	nbRadioSnr = NbiotClientHandler.Parameter.statisticsRADIO.SNR < -127 ? -127 : NbiotClientHandler.Parameter.statisticsRADIO.SNR;
#elif NETPROTOCAL == NETMQTTSN
	nbRadioSnr = MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR >  127 ?  127 : MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR;
	nbRadioSnr = MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR < -127 ? -127 : MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.SNR;
#elif NETPROTOCAL == NETONENET
	nbRadioSnr = OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR >  127 ?  127 : OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR;
	nbRadioSnr = OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR < -127 ? -127 : OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.SNR;
#endif
	
	return nbRadioSnr;
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioEARFCN(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioEARFCN				: 读取Nbiot RadioEARFCN值
 @Input				void
 @Return				RadioEARFCN
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioEARFCN(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.EARFCN;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.EARFCN;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.EARFCN;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioPCI(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioPCI				: 读取Nbiot RadioPCI值
 @Input				void
 @Return				RadioPCI
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioPCI(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.PCI;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.PCI;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.PCI;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioRSRQ(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioRSRQ				: 读取Nbiot RadioRSRQ值
 @Input				void
 @Return				RadioRSRQ
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioRSRQ(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.RSRQ;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.RSRQ;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.RSRQ;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellEarfcn(void)
 @Description			TCFG_Utility_Get_Nbiot_CellEarfcn				: 读取Nbiot CellEarfcn值
 @Input				void
 @Return				CellEarfcn
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellEarfcn(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.earfcn;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.earfcn;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.earfcn;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellPhysicalCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_CellPhysicalCellID		: 读取Nbiot PhysicalCellCellID值
 @Input				void
 @Return				CellCellID
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellPhysicalCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.physicalcellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.physicalcellID;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.physicalcellID;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellPrimaryCell(void)
 @Description			TCFG_Utility_Get_Nbiot_CellPrimaryCell			: 读取Nbiot PrimaryCellCell值
 @Input				void
 @Return				CellCell
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellPrimaryCell(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.primarycell;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.primarycell;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.primarycell;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellRsrp(void)
 @Description			TCFG_Utility_Get_Nbiot_CellRsrp				: 读取Nbiot CellRsrp值
 @Input				void
 @Return				CellRsrp
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellRsrp(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.rsrp;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.rsrp;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.rsrp;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellRsrq(void)
 @Description			TCFG_Utility_Get_Nbiot_CellRsrq				: 读取Nbiot CellRsrq值
 @Input				void
 @Return				CellRsrq
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellRsrq(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.rsrq;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.rsrq;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.rsrq;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellCellrssi(void)
 @Description			TCFG_Utility_Get_Nbiot_CellCellrssi			: 读取Nbiot CellCellrssi值
 @Input				void
 @Return				CellCellrssi
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellCellrssi(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsCELL.rssi;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.rssi;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.rssi;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_CellSnr(void)
 @Description			TCFG_Utility_Get_Nbiot_CellSnr				: 读取Nbiot CellSnr值
 @Input				void
 @Return				Nbiot_CellSnr
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_CellSnr(void)
{
	int nbRadioSnr = 0;
	
#if NETPROTOCAL == NETCOAP
	nbRadioSnr = NbiotClientHandler.Parameter.statisticsCELL.snr >  127 ?  127 : NbiotClientHandler.Parameter.statisticsCELL.snr;
	nbRadioSnr = NbiotClientHandler.Parameter.statisticsCELL.snr < -127 ? -127 : NbiotClientHandler.Parameter.statisticsCELL.snr;
#elif NETPROTOCAL == NETMQTTSN
	nbRadioSnr = MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr >  127 ?  127 : MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr;
	nbRadioSnr = MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr < -127 ? -127 : MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsCELL.snr;
#elif NETPROTOCAL == NETONENET
	nbRadioSnr = OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr >  127 ?  127 : OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr;
	nbRadioSnr = OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr < -127 ? -127 : OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsCELL.snr;
#endif
	
	return nbRadioSnr;
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusTac(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegistStatusTac	: 读取Nbiot NetworkRegistStatusTac值
 @Input				void
 @Return				Nbiot_NetworkRegistStatusTac
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusTac(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.tac;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegistStatusCellID	: 读取Nbiot NetworkRegistStatusCellID值
 @Input				void
 @Return				Nbiot_NetworkRegistStatusCellID
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegistStatusCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.cellID;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_GetCoapConnectTime(void)
 @Description			TCFG_Utility_GetCoapConnectTime				: 读取Nbiot CoapConnectTime值
 @Input				void
 @Return				Nbiot_CoapConnectTime
**********************************************************************************************************/
unsigned int TCFG_Utility_GetCoapConnectTime(void)
{
	return NbiotClientHandler.CoapConnectTimeSec;
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_GetCoapIdleTime(void)
 @Description			TCFG_Utility_GetCoapIdleTime					: 读取Nbiot CoapIdleTime值
 @Input				void
 @Return				Nbiot_CoapIdleTime
**********************************************************************************************************/
unsigned int TCFG_Utility_GetCoapIdleTime(void)
{
	return NbiotClientHandler.CoapIdleTimeSec;
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersion(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersion	: 读取Nbiot PCPPlatformSoftVersion值
 @Input				void
 @Return				Nbiot_PCPPlatformSoftVersion
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersion(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)PCPClientHandler.Parameter.PlatformSoftVersion;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNPCPClientHandler.Parameter.PlatformSoftVersion;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionMajor(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionMajor	: 读取Nbiot PCPPlatformSoftVersionMajor值
 @Input				void
 @Return				Nbiot_PCPPlatformSoftVersionMajor
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionMajor(void)
{
	unsigned int softMajor = 0;
	unsigned int softSub = 0;
	
#if NETPROTOCAL == NETCOAP
	sscanf((const char*)PCPClientHandler.Parameter.PlatformSoftVersion, "V%d.%d", &softMajor, &softSub);
#elif NETPROTOCAL == NETMQTTSN
	sscanf((const char*)MqttSNPCPClientHandler.Parameter.PlatformSoftVersion, "V%d.%d", &softMajor, &softSub);
#endif
	
	return softMajor;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionSub(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionSub		: 读取Nbiot PCPPlatformSoftVersionSub值
 @Input				void
 @Return				Nbiot_PCPPlatformSoftVersionSub
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_PCPPlatformSoftVersionSub(void)
{
	unsigned int softMajor = 0;
	unsigned int softSub = 0;
	
#if NETPROTOCAL == NETCOAP
	sscanf((const char*)PCPClientHandler.Parameter.PlatformSoftVersion, "V%d.%d", &softMajor, &softSub);
#elif NETPROTOCAL == NETMQTTSN
	sscanf((const char*)MqttSNPCPClientHandler.Parameter.PlatformSoftVersion, "V%d.%d", &softMajor, &softSub);
#endif
	
	return softSub;
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceSize(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceSize	: 读取Nbiot PCPUpgradePackSliceSize值
 @Input				void
 @Return				Nbiot_PCPUpgradePackSliceSize
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceSize(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradePackSliceSize;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradePackSliceSize;
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceNum(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceNum	: 读取Nbiot PCPUpgradePackSliceNum值
 @Input				void
 @Return				Nbiot_PCPUpgradePackSliceNum
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceNum(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradePackSliceNum;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradePackSliceNum;
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceIndex(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceIndex	: 读取Nbiot PCPUpgradePackSliceIndex值
 @Input				void
 @Return				Nbiot_UpgradePackSliceIndex
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackSliceIndex(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradePackSliceIndex;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradePackSliceIndex;
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackCheckCode(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradePackCheckCode	: 读取Nbiot PCPUpgradePackCheckCode值
 @Input				void
 @Return				Nbiot_PCPUpgradePackCheckCode
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradePackCheckCode(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradePackCheckCode;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradePackCheckCode;
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradeStartTimes(void)
 @Description			TCFG_Utility_Get_Nbiot_PCPUpgradeStartTimes		: 读取Nbiot PCPUpgradeStartTimes值
 @Input				void
 @Return				Nbiot_PCPUpgradeStartTimes
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_PCPUpgradeStartTimes(void)
{
#if NETPROTOCAL == NETCOAP
	return PCPClientHandler.Parameter.UpgradeStartTimes;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNPCPClientHandler.Parameter.UpgradeStartTimes;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Manufacturer(void)
 @Description			TCFG_Utility_Get_Nbiot_Manufacturer			: 读取Nbiot Manufacturer值
 @Input				void
 @Return				Nbiot_Manufacturer
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Manufacturer(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.manufacturer;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.manufacturer;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.manufacturer;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Manufacturermode(void)
 @Description			TCFG_Utility_Get_Nbiot_Manufacturermode			: 读取Nbiot Manufacturermode值
 @Input				void
 @Return				Nbiot_Manufacturermode
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Manufacturermode(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.manufacturermode;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.manufacturermode;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.manufacturermode;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_ModelVersion(void)
 @Description			TCFG_Utility_Get_Nbiot_ModelVersion			: 读取Nbiot ModelVersion值
 @Input				void
 @Return				Nbiot_ModelVersion
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_ModelVersion(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.modelversion;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.modelversion;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.modelversion;
#endif
}

